{
  "MainNav": [
    { "path": "home", "linkName": "Home" },
    { "path": "breeds", "linkName": "Breeds" },
    { "path": "donate", "linkName": "Donate" },
    { "path": "contact", "linkName": "Contact" }
  ],

  "Pages": [
    {
      "pageName": "home",
      "content": "<section class='hero-wrapper'><div class='hero-info'><h1>Aw-dopt!</h1><h2>Looking to adopt a new furry friend? Not sure where to start?</h2><h3>You've come to the right place! Let's find the right dog for you.</h3></div></section><section class='consider-wrapper'><div class='consider-info'><h1>What should you consider before you adopt?</h1><p>Most people know the positives of adopting a dog. They are adorable for sure which is one of the leaning reasons people choose to adopt puppies! Who wouldn't want an adorable exercise partner, cuddle buddy, friend, and addition to the family with all these happy traits? This doesn't happen by chance, typically it requires a lot of training, care, and money to adopt a dog or puppy. This is a decision that shouldn't be taken lightly. A lot of people think they are ready for a dog when they don't realize how big of a responsibility it is. There are so many things to take into account, such as breed, demeanor, age, and more that can work best for you when it comes to a dog. If you want to learn more about specific breeds, check out our breeds link on this website! Once you have an idea of what kind of dog you're looking for, we can dive into the information below.</p><h2>Commitment</h2><div class='consider-info-holder'><div class='consider-image commit'></div><p>The first one to two years of having a puppy if so much more difficult than an adopted dog. If you don't spend time training them and caring for them, it can effect you in the long wrong such as aggressive behavior, complaints from those around you, and many more problems can arise. It will take many hours every day to train and exercise your puppy, but it will really pay off in the long run. Not to mention you will also need to commit some money towards training classes to help socialize your dog. Some places offer free training, but most cost at least a small fee, while higher levels can be in the hundreds and thousands. Be sure that you are ready to commit the time, money, and energy if you decide to adopt a puppy. Another option is to adopt an older dog which is in a way a shortcut past the training, but you will still have to adjust you life to be compatible for the adopted dogs. Older dogs have past and may still need some traiining and other adjusments, so be ready to commit time to that as well. Some of the reason dogs sadly get taken to the shelter is because they shed too much or have too much energy or are improperly trained. These are important questions you can ask your vet or adoption agency before you choose to adopt so that you can find a dog to fit your lifestyle. Ultimately, be prepared to commit multiple hours a day to your pet, regardless of the starting point.</p></div><h2>Grooming</h2><div class='consider-info-holder'><p class='right'>Dogs need to be groomed too! Their nails need to be clipped, their fur needs brushed(especially long haired breeds), and they need to be bathed. They also need to have their teeth brushed. Alongside this a good alternative if you can't always get your dog to sit still to brush his teeth are some dental chews/toys. Although this will not replace dental care, you can also get professional cleaning done if you so choose. If you get this professionally done it can cost $50-$90 and it will need to be done every few months, especially long haired breeds. Along with this, your dogs fur will be everywhere! It will get on your clothes, furniture, your own mouth, sometimes in your food, and on yourself almost always! Another big thing to keep in mind is allergies. Are you allergic to dogs or are any of your family members?</p><div class='consider-image groom'></div></div><h2>Healthcare</h2><div class='consider-info-holder'><div class='consider-image vet'></div><p>Be prepared to spend money on your pet's insurance too in case of emergency. You will need to buy flea and tick monthly as well as heartworm monthly or every 6 months. It costs around $15-$20 dollars for flea and tick and heartworm can be around the same or if you do it every six months it will be around $60. These are rough estimates which will always vary on size, weight, and breed. Most pet plans will cost around $30-$40 a month. You can pay per visit, but having to do yearly vaccinations, paying for flea and tick, pet injuries, and more can add up over time. Having pet insurance typically gives you discounts and even sometimes free accommodations. Don't let this fool you, you will still need to have a lot of money saved back before you adopt. Major medical issues are common over the lifespan of a dog. Sometimes difficult decisions have to be made. Do you spend thousands of dollars to perserve a high quality of life or put them to sleep? This is a hard line to draw but something you will have to accept when you own any pet, and at some point we unfortunately will all have to face.</p></div><h2>Socialization</h2><div class='consider-info-holder'><p class='right'>Socialization is important for dogs especially at an early age to develop the right interactions. If you fail to socialize your dogs they can have issues of fear or aggression when it comes to new people, animals, or even objects. A good thing to help socialize is to go to training classes or take them to doggy daycare so they can have and learn positive interactions with other dogs. Dogs are inherently social animals and isolating them can be damaging to their and your own happiness. A well socialized dog will have a happy life and make your life a lot more fun and easy with your dog.</p><div class='consider-image social'></div></div></div></section><div class='footer-wrapper'><div class='footer'><div class='copyright'>Copyright Sarah Tejchma 2020</div><a href='resources.html'>site resources</a></div></div>"
    },
    {
      "pageName": "breeds",
      "content": "<section class='breeds-wrapper'><div class='title-holder'><h1>Different types of dog breeds:</h1><p>When it comes to adopting a dog, some breeds can vary in what they need to live a happy life. Some dogs are energetic, while others are happy cuddling on the couch all day. Some dogs may be happier working but could also make a great family pet if you're up to the challenge of keeping them entertained. Choosing a dog is not only about the dog, but about yourself and how much time you are willing or able to dedicate. To explain a few different examples of dogs that may be a good choice for you, we are going to explain the top 10 most breeds by size as well as low energy, high energy, and hypoallergenic breeds. Now when going to adopt you most likely won't find a purebred unless you choose to rescue, but these traits can still help you identify a dog similar to a mix or breed you choose to add to your family.</p></div><div class='title-holder'><h4>Most Popular Small Breeds</h4></div><div class='breed'><div class='breed-info bull'><h2>French Bulldog</h2><h3>Lifespan: 10-12 years<br><br>Temperament: adaptable, playful, intelligent <br><br> They are famous for their large ears and smashed in nose. It is great for people who live in a city, apartment, or pretty much anywhere. They adapt very well to different living situations and are very relaxe and loyal. This makes it ideal for single owners, couples, or families. Overall this is a flexible and loving dog that can fit into any home!</h3></div></h1><div class='breed-info beagle'><h2>Beagle</h2><h3>Lifespan: 10-15 years<br><br>Temperament: friendly, curious, happy <br><br>Beagles have amazing noses and were bred to hunt and live in packs. They are very social and love the company of dogs and people. This dog is perfect to add to a family that already has a dog as well as kids, as they are friendly in the right household.</h3></div><div class='breed-info poodle'><h2>Poodle</h2><h3>Lifespan: 10-18 years<br><br>Temperament: active, proud, intelligent <br><br>Poodles are one of the most famous aristocratic breeds. They are among some of the smarts and most athletic dogs and are easy to train. They would work well in an active family. </h3></div><div class='breed-info york'><h2>Yorkshire Terrier</h2><h3>Lifespan: 11-15 years<br><br>Temperament: affectionate, sprightly, tomboy-ish <br><br> This breed is known as a lap dog that loves to cuddle but were bred to start to work in mines and mills. They are tiny but can be feisty and brave but also very affectione in the right home.</h3></div><div class='breed-info duch'><h2>Dachshund</h2><h3>Lifespan: 12-16 years<br><br>Temperament: friendly, curious, excitable <br><br>You may recognize this breed for it's little legs and long body. They usually don't get larger than 8 or 9 inches tall. It is a good dog for a family home.</h3></div><div class='breed-info corgi'><h2>Pembroke Welsh Corgi</h2><h3>Lifespan: 12-13 years<br><br>Temperament: affectionate, smart, alert <br><br> This is a herding breed that needs a lot of exercise to be kept happy, definitely more exercise than most small breeds. If it has an owner that is as physically active as it is, then it can be a wonderful pet to have.</h3></div><div class='breed-info span'><h2>Cavalier King Charles Spaniel</h2><h3>Lifespan: 12-15 years<br><br>Temperament: affectionate, gentle, graceful <br><br>This dog is a mixture of a toy breed and athleticism of a sporting dog, so it definitely needs exercise and attention. It is a house dog that makes for a perfect family dog as it loves to be around people and doesn't like being left alone.</h3></div><div class='breed-info mini'><h2>Miniature Schnauzer</h2><h3>Lifespan: 12-15 years<br><br>Temperament: friendly, intelligent, obedient. <br><br>These dogs were bread to farm and watchdogs. They have large bushy beards and eyebrows. This breed needs exercise but can be happy in most homes.</h3></div><div class='breed-info shih'><h2>Shih Tzu</h2><h3>Lifespan: 10-18 years<br><br>Temperament: loving, playful, outgoing <br><br>Also known as the 'lion dog' this dog breed gets along really well with children! So if you have kids, this breed may be a good choice for you. Is happy in most any living space.</h3></div><div class='breed-info pom'><h2>Pomeranian</h2><h3>Lifespan: 12-16 years <br><br>Temperament: curious, strong, and lively <br><br>They learn tricks easily and typically weigh around 3 to 7 pounds! Has a decent amount of energy for a small dog, so will need at least minimal exercise.</h3></div></div><div class='title-holder'><h4>Most Popular Large Breeds</h4></div><div class='breed'><div class='breed-info lab'><h2>Labrador Retriever</h2><h3>Lifespan: 10-14 years<br><br>Temperament: intelligent, gentle, outgoing <br><br> This breed of dog is top of the charts for a good reason. They are perfect for any owner. They make excellent working dogs, service dogs, companion dogs, and family dogs. They are easily trained and willing and happy to learn and love being around people and other creatures. Over all one of the most friendly dogs you could own. It's lovable personality makes it one of the most popular breeds. There love is as big as they are!</h3></div></h1><div class='breed-info german'><h2>German Shepherd</h2><h3>Lifespan: 9-13 years<br><br>Temperament: curious, obedient, intelligent<br><br>One of the most versatile dogs. They also can be considered as a working dog or a companion dog. They are intelligent and eager to serve and learn. They are very intelligent and need to be kept busy as they can get bored easily because of this. They are very active and need to be trained well and can become a perfect gaurdian, worker, or family member.</h3></div><div class='breed-info golden'><h2>Golden Retriever</h2><h3>Lifespan: 10-12 years<br><br>Temperament: reliable, friendly, trustworthy <br><br>Named after their golden fur, they also attain a heart of gold. This breed is well known for it's compatibility with children. If you have kids this dog is perfect for your family, as they seem to love everyone they meet. This is the perfect family dog, they are fine living inside but like most large dogs need daily exercise. </h3></div><div class='breed-info stanpoodle'><h2>Standard Poodle</h2><h3>Lifespan: 12-15 years<br><br>Temperament: alert, intelligent, loyal <br><br>This is one of the most intelligent dog breeds and training them comes easily. It is a very affectionate breed, so be prepared for lots of cuddles and attention. They are also a very active breed.</h3></div><div class='breed-info rott'><h2>Rottweiler</h2><h3>Lifespan: 8-10 years<br><br>Temperament: obedient, fearless, devoted <br><br>These dogs have recieved negative attention on tv, although that doesn't falter their popularity. This is for good reason, despite their repuation they are a very intelligent, good-natured breed. They are very loyal and attentive to their family. They are considered a herding dog but are very adaptable to other roles. They could work as a gaurd dog, a service dog, or even a loving addition to your family.</h3></div><div class='breed-info germanshort'><h2>German Shorthaired Pointer</h2><h3>Lifespan: 12-13 years<br><br>Temperament: boisterous, affectionate, bold <br><br>Known truthfully as a hunting and gun dog, this breed requires a lot of exercise and attention. Properly trained it makes an ideal companion for owners who live an active lifestyle and have a love for the outdoors. Otherwise this headstrong breed may provide to be a challenge for first time owners who aren't ready to take the lead. This breed is more for experienced owners, but still can make a great companion in the right hands.</h3></div><div class='breed-info dane'><h2>Great Dane</h2><h3>Lifespan: 8-10 years<br><br>Temperament: devoted, friendly, loving <br><br>Knwon for it's huge size and matching personality, the great dane is one of the largest dog breeds. It is often thought to be the world's tallest dog. They are gentle giants that are typically friendly and calm despit their large size. They require a lot of love, attention, and a lot of space since they are such a large breed. So make sure if you decide to get this breed you have room in your large home and a yard for them to stretch their legs in. Because of their size their life span is not as long as most breeds.</h3></div><div class='breed-info mastiff'><h2>Mastiff</h2><h3>Lifespan:6-12 years<br><br>Temperament: affectionate, good-natured, protective <br><br>This dog's appearance is very powerful. They are huge, not quite as large as a Great Dane but cutting it close. This breed makes and excellent gaurdian. Although they may seem like a beasy, they are gentle, affectionate, and loyal. It's devotion to owners and patience for children are what have secured its popularity as a large dog breed for many years. As long as you have the space, this makes a perfect family dog.</h3></div><div class='breed-info collie'><h2>Collie</h2><h3>Lifespan: 14-16 years<br><br>Temperament: intelligent, loyal, active <br><br>This is a very popular breed for it's sharp mind and friendly personality. The collie is active and needs exrcised. It rarely shows signs of any aggression, unless protecting it's family. Known as one of the most fearless and gentle, the collie makes a perfect family dog. </h3></div><div class='breed-info bern'><h2>Bernese Mountain Dog</h2><h3>Lifespan: 12-16 years. <br><br>Temperament: curious, strong, and lively <br><br>This dog breed has become very popular throughout the years, recognized by it's affectionate personality and intelligence. It has adorable features and is a true outdoor dog that fares well in cold weather. This breed is very patient and loyal, and makes a great addition to a family with children.</h3></div></div></section><div class='footer-wrapper'><div class='footer'><div class='copyright'>Copyright Sarah Tejchma 2020 </div> <a href='resources.html'>site resources</a></div></div>"
    },
    {
      "pageName": "donate",
      "content": "<section class='donate-wrapper'><h1>Donate to your local shelters</h1><h2>Ways you can Donate:</h2></<h2><div class='donate'><div class='image-holder-merch'><h3>Merch</h3><div class='merch-image'></div><p>One way you can donate is by purchasing one of our merch items such as a sticker to bracelet! More to come in the future. Essentially we have a minimum of $5 for each item as most items take a few cents to make so that we can put any proceeds outside of cost of production towards shelters in need!</p></div><div class='image-holder-food'><h3>Food</h3><div class='food-image'></div><p>One vital need for shelters is to make sure all the pups are fed. Using this option you donate specifically for food and treats for the dog! All proceeds go towards this cause.</p></div><div class='image-holder-money'><h3>Donation</h3><div class='money-image'></div><p>A very straight forward way of donating is to choose a donation amount and donate. This allows shelters to put the money towards things like medicines and care for the pets or really whatever the animals needs!</p></div></div></section><div class='footer-wrapper'><div class='footer'><div class='copyright'>Copyright Sarah Tejchma 2020 </div><a href='resources.html'>site resources</a></div></div>"
    },
    {
      "pageName": "contact",
      "content": "<div class='footer-wrapper'><div class='footer'><div class='copyright'>Copyright Sarah Tejchma 2020 </div><a href='resources.html'>site resources</a></div></div>"
    }
  ]
}
